{
  "exercises": [
    {
      "name": "Crunches",
      "description": "The crunch is a classic core exercise. It specifically trains your abdominal muscles, which are part of your core.",
      "muscle_group": "Abs"
    },
    {
      "name": "Push-ups",
      "description": "Great push-up form starts with a rigid plank. Your arms should be fully extended, with your hands, elbows, and shoulders all in line, and your feet should be no more than 12 inches apart—the closer together, the more difficult the push-up, because it requires more core activation for stability.",
      "muscle_group": "Chest"
    },
    {
      "name": "Pull-ups",
      "description": "A pull-up is an upper-body strength exercise. The pull-up is a closed-chain movement where the body is suspended by the hands and pulls up.",
      "muscle_group": "Back"
    },
    {
      "name": "Squats",
      "description": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up.",
      "muscle_group": "Legs"
    },
    {
      "name": "Lunges",
      "description": "A lunge can refer to any position of the human body where one leg is positioned forward with knee bent and foot flat on the ground while the other leg is positioned behind.",
      "muscle_group": "Legs"
    },
    {
      "name": "Plank",
      "description": "The plank (also called a front hold, hover, or abdominal bridge) is an isometric core strength exercise that involves maintaining a position similar to a push-up for the maximum possible time.",
      "muscle_group": "Abs"
    },
    {
      "name": "Left side plank",
      "description": "The same principle as 'The plank', but this time you'll only lean on your left arm where your left side will be just above the ground and your right side to the sky's direction.",
      "muscle_group": "Abs"
    },
    {
      "name": "Right side plank",
      "description": "The same principle as 'The plank', but this time you'll lean on your right arm where your right side will be just above the ground and your left side to the sky's direction.",
      "muscle_group": "Abs"
    },
    {
      "name": "Flutter kicks",
      "description": "Flutter kicks are an exercise that works the muscles of your core, specifically the lower rectus abdominal muscles, plus the hip flexors. They mimic a swimming stroke, but are performed on dry land.",
      "muscle_group": "Abs"
    },
    {
      "name": "Superman",
      "description": "Work your lower back — and the whole backside of your body — with a superman. Go as slowly as you can here to really reap the benefits of this move.",
      "muscle_group": "Lower back"
    },
    {
      "name": "Bicycle crunch",
      "description": "You'll work on your core with this exercise. You make the movement of a crunch but your left leg will come towards your right elbow and your right leg will come towards left elbow",
      "muscle_group": "Abs"
    },
    {
      "name": "Wall sit",
      "description": "Sit against a wall where your knee's are have a 90 degree corner. You'll work on all parts of your legs while also increasing your leg's muscle endurance.",
      "muscle_group": "Legs"
    },
    {
      "name": "Toe touches",
      "description": "Put your legs in the air, and try to touch your toes while keeping your legs straight.",
      "muscle_group": "Abs"
    },
    {
      "name": "Reverse crunch",
      "description": "Instead of making bringing your upper body up. Bring you Legs towards your Upper body while laying down. Push your hands against the ground to maintain stability.",
      "muscle_group": "Abs"
    },
    {
      "name": "Leg raises",
      "description": "Lie down and bring you legs up while keeping them straight and holding the rest of your body on the ground.",
      "muscle_group": "Abs"
    }
  ]
}